app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def book
    @book= Book.all

INSERT INTO "books" ("category", "created_at", "publishing", "stock", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category", "lk"], ["created_at", Tue, 05 Nov 2013 20:08:33 UTC +00:00], ["publishing", "uach"], ["stock", 10], ["title", "prueba 2 "], ["updated_at", Tue, 05 Nov 2013 20:08:33 UTC +00:00]]
---
  def create
    @book = Book.new(book_params)
    if @book.save